from pybricks.hubs import PrimeHub
from pybricks.pupdevices import Motor, ColorSensor, UltrasonicSensor, ForceSensor
from pybricks.parameters import Button, Color, Direction, Port, Side, Stop
from pybricks.robotics import DriveBase
from pybricks.tools import wait, StopWatch

hub = PrimeHub()

########################################################

wait(1000)  # หน่วงเวลา 1000 มิลลิวินาที = 1 วินาที
########################################################
########################################################

for i in range(10):      # ทำซ้ำ 10 ครั้ง
    print(i)             # แสดงเลขรอบ
# ตัวอย่าง ใช้กับหุ่นหจริง
    for i in range(4):            # ทำ 4 รอบ
    robot.turn(90)            # หมุน 90°

########################################################
########################################################


    while True:              # ลูปไม่มีวันหยุด
    print("Running")

# ตัวอย่าง ใช้กับหุ่นหจริง

while True:                           # ทำตลอด
    if ultrasonic.distance() < 100:   # ถ้าระยะ < 100 mm
        break                         # หยุดลูปทันที
    robot.drive(200, 0)               # วิ่งตรง

########################################################
########################################################

if เงื่อนไข:
    คำสั่ง
# ตัวอย่าง ใช้กับหุ่นหจริง
if color_sensor.color() == Color.BLACK:   # ถ้าเจอสีดำ
    robot.stop()                          # หยุด

########################################################
########################################################

if ultrasonic.distance() < 100:   # ถ้าใกล้กำแพง
    robot.stop()
else:
    robot.drive(200, 0)           # ถ้าไม่ใกล้ → วิ่งต่อ

########################################################
########################################################

while not hub.buttons.pressed():  # ถ้ายังไม่มีปุ่มถูกกด
    wait(10)                      # รอ 10 ms แล้วเช็คใหม่

########################################################
########################################################

while hub.imu.heading() < 90:   # ทำจนมุมถึง 90°
    left_motor.run(200)
    right_motor.run(-200)

########################################################
########################################################

raise SystemExit   # จบโปรแกรมทันที

########################################################
########################################################