"""
 ██╗  ██╗██╗  ██╗██████╗ ██╗  ██╗██╗   ██╗██████╗ 
 ██║ ██╔╝██║ ██╔╝██╔══██╗██║  ██║██║   ██║██╔══██╗
 █████╔╝ █████╔╝ ██████╔╝███████║██║   ██║██████╔╝
 ██╔═██╗ ██╔═██╗ ██╔══██╗██╔══██║██║   ██║██╔══██╗
 ██║  ██╗██║  ██╗██║  ██║██║  ██║╚██████╔╝██████╔╝
 ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚═════╝
"""

# =========================
# นำเข้า (ไม่จำเป็นต้องรู้ก็ได้)
# =========================
from pybricks.hubs import PrimeHub          # หัวหมอง SPIKE Prime
from pybricks.pupdevices import Motor       # ใช้ควบคุมมอเตอร์
from pybricks.parameters import Port        # ใช้กำหนดพอร์ต
from pybricks.robotics import DriveBase     # ระบบรถ 2 ล้อ
from pybricks.tools import wait             # หน่วงเวลา

# =========================
# กำหนดอุปกร บลาๆ
# =========================
hub = PrimeHub()

left_motor = Motor(Port.A)      # มอเตอร์ซ้าย
right_motor = Motor(Port.B)     # มอเตอร์ขวา

# -------------------------------------------------
# =========================
# กำหนด อะไรสักอย่าง พร้อมวิธี
# =========================
# 56  = ขนาดล้อ (mm)
# 112 = ระยะห่างล้อซ้าย-ขวา (mm)
#
# 🔴 ถ้าวิ่งเกิน → ลด 56 ลง (เช่น 55.8)
# 🔵 ถ้าวิ่งไม่ถึง → เพิ่ม 56 ขึ้น (เช่น 56.2)
#
# 🔴 ถ้าหมุนเกิน → เพิ่ม 112 ขึ้น (เช่น 113)
# 🔵 ถ้าหมุนไม่ถึง → ลด 112 ลง (เช่น 111)
# -------------------------------------------------
robot = DriveBase(left_motor, right_motor, 56, 112)

# =========================
# ตั้งค่าความเร็ว (ตั้งค่าเองได้)
# =========================
robot.settings(
    straight_speed=300,         # ความเร็ววิ่งตรง (mm/s)
    straight_acceleration=500,  # ความแรงตอนออกตัว
    turn_rate=200,              # ความเร็วตอนหมุน (deg/s)
    turn_acceleration=400       # ความแรงตอนเริ่มหมุน
)

# =========================
# ทดสอบเดินตรง
# =========================
robot.straight(1000)   # วิ่ง 1000 mm (1 เมตร)
wait(2000)

# วัดจริงด้วยไม้บรรทัด
# ถ้าได้ 1015 mm → เกิน → ลดค่า 56 ลง
# ถ้าได้ 985 mm  → ไม่ถึง → เพิ่มค่า 56 ขึ้น

# =========================
# ทดสอบหมุน
# =========================
robot.turn(360)        # หมุน 360 องศา (เปลี่ยน เป็นเลี้ยวก็ 90 เลี้ยวซ้าย ติดลบ -90)
wait(2000)

# ดูว่ากลับจุดเดิมไหม
# ถ้าหมุนได้ 370° → หมุนเกิน → เพิ่มค่า 112
# ถ้าหมุนได้ 350° → หมุนไม่ถึง → ลดค่า 112
